Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаИзмененияЦены/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаНачалаДействияЦены = НачалоДня(ТекущаяДата());
	Номенклатура = Параметры.Номенклатура;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()           
	ЦеныНоменклатуры = РегистрыСведений.Цены;
	НаборЗаписей = ЦеныНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Отбор.ТипЦены.Установить(ВидЦены);
	НаборЗаписей.Отбор.Период.Установить(ДатаНачалаДействияЦены);

	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() Тогда
	    НаборЗаписей[0].Цена = Цена;
	Иначе
	    НоваяЗаписьЦен = НаборЗаписей.Добавить();
	    НоваяЗаписьЦен.Номенклатура = Номенклатура;
	    НоваяЗаписьЦен.ТипЦены = ВидЦены;
	    НоваяЗаписьЦен.Период = ДатаНачалаДействияЦены;
	    НоваяЗаписьЦен.Цена = Цена;
	КонецЕсли;
	НаборЗаписей.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЦенаНаДату = РаботаСЦенами.ПолучитьЦенуНаКонкретнуюДату(Номенклатура, ВидЦены, ДатаНачалаДействияЦены); 
	Если ЗначениеЗаполнено(ЦенаНаДату) Тогда        
		ТекстВопроса = СтрШаблон("На указанную дату уже имеется введенная цена %1, вы действительно хотите изменить цену?", ЦенаНаДату);
		ОбратныйВызов = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииЦены", ЭтаФорма);        
		ПоказатьВопрос(ОбратныйВызов, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");    
	Иначе
		ЗаписатьНаСервере();
		Закрыть();
 	КонецЕсли;
КонецПроцедуры       


&НаСервере
Процедура ПриОткрытииНаСервере()
	ДатаНачалаДействияЦены = НачалоДня(ТекущаяДата());
	Номенклатура = Параметры.Номенклатура;
КонецПроцедуры
